BACKGROUND_COLOR = (9, 99, 0)  # צבע הרקע הירוק הראשי
explotion_IMG = "explotion.png"  # שם קובץ תמונת הפיצוץ
grass_IMG = "grass.png"  # שם קובץ תמונת הדשא (השיחים)
injury_IMG = "injury.png"  # שם קובץ תמונת הפציעה
snake_IMG = "snake.png"  # שם קובץ תמונת הנחש
soldier_IMG = "soldier.png"   # שם קובץ תמונת החייל ביום
solider_night_IMG = "soldier_nigth.png" # שם קובץ תמונת החייל בלילה
flag_IMG = "flag.png"   # שם קובץ תמונת הדגל

ROWS = 25 # הגדרת מספר השורות במטריצת המשחק (25 שורות)
COLS = 50  # הגדרת מספר העמודות במטריצת המשחק (50 עמודות)
CELL_SIZE = 25  # הגדרת הגודל של כל משבצת בודדת בפיקסלים על המסך (25 פיקסלים)

WIDTH = COLS * CELL_SIZE # חישוב רוחב חלון המשחק בפיקסלים (מספר העמודות כפול גודל משבצת)
HEIGHT = ROWS * CELL_SIZE # חישוב גובה חלון המשחק בפיקסלים (מספר השורות כפול גודל משבצת)

GREEN = (34, 139, 34) # הגדרת צבע ירוק עבור הרקע של המשחק
BLACK = (0, 0, 0) # הגדרת צבע שחור עבור רקע "דימוי שדה" (Enter)
GRAY = (50, 50, 50) # הגדרת צבע אפור עבור קווי הרשת של המטריצה
WHITE = (255, 255, 255)  # הגדרת צבע לבן לשימוש כללי
RED = (255, 0, 0) # הגדרת צבע אדום עבור תצוגת המוקשים
DARK_GREEN = (0, 100, 0) # הגדרת צבע ירוק כהה עבור השיחים

PLAYER_WIDTH = 2 # הגדרת רוחב דמות השחקן (2 משבצות)
PLAYER_HEIGHT = 4  # הגדרת גובה השחקן (4 משבצות)
FLAG_WIDTH = 4  # הגדרת רוחב הדגל (4 משבצות)
FLAG_HEIGHT = 3  # הגדרת גובה הדגל (3 משבצות)
MINE_WIDTH = 3  # הגדרת רוחב כל מוקש (3 משבצות)
MINE_HEIGHT = 1  # הגדרת גובה כל מוקש (משבצת אחת)

NUM_BUSHES = 20 # הגדרת כמות השיחים שיופיעו על המסך (20 שיחים)
NUM_MINES = 20  # הגדרת כמות המוקשים שיופיעו על המסך (20 מוקשים)

